console.log('-------------Task1-additional-1: Цикли-------------')
// --створити масив з:
// - з 5 числових значень
// - з 5 стрічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
let arr = [62, 567, 436, 98, 55, "st1", "st2", "st3", "st4", "st5", true, false];
for (let i = 0; i < arr.length; i++) {
    console.log(arr[i]);
}

console.log('-------------Task2-additional-1: Цикли-------------')
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
let arr2 = [];

console.log('-------------Task3-additional-1: Цикли-------------')
// - є масив [2,17,13,6,22,31,45,66,100,-18] :
console.log('1. перебрати його циклом while')
// 1. перебрати його циклом while
let arr3 = [2,17,13,6,22,31,45,66,100,-18];
let i = 0;
while (i <arr3.length) {
    console.log(arr3[i])
    i++
}
console.log('2. перебрати його циклом for')
// 2. перебрати його циклом for
for (let i = 0; i < arr3.length; i++) {
    console.log(`${[i]} - ${arr3[i]}`)
}
console.log('3. перебрати циклом while та вивести числа тільки з непарним індексом')
// 3. перебрати циклом while та вивести числа тільки з непарним індексом
let a = 1;
while (a < arr3.length) {
    console.log(`${[a]} - ${arr3[a]}`)
    a+=2;
}
console.log('4. перебрати циклом for та вивести числа тільки з непарним індексом')
// 4. перебрати циклом for та вивести числа тільки з непарним індексом
for (let i = 1; i < arr3.length; i+=2) {
    console.log(`${[i]} - ${arr3[i]}`)
}
console.log('5. перебрати циклом while та вивести числа тільки парні значення')
// 5. перебрати циклом while та вивести числа тільки парні значення
let y = 0;
while (y < arr3.length) {
    console.log(`${[y]} - ${arr3[y]}`)
    y+=2;
}
console.log('6. перебрати циклом for та вивести числа тільки парні значення')
// 6. перебрати циклом for та вивести числа тільки парні значення
for (let i = 0; i < arr3.length; i+=2) {
    console.log(`${[i]} - ${arr3[i]}`)
}
console.log('7. замінити кожне число кратне 3 на слово "okten"')
// 7. замінити кожне число кратне 3 на слово "okten"
// for (let i = 0; i < arr3.length; i++) {
//     if (arr3[i] % 3 === 0){
//         arr3[i] = "okten";
//     }
//     console.log(arr3[i])
// }
console.log('8. вивести масив в зворотному порядку.')
// 8. вивести масив в зворотному порядку.
for (let i = arr3.length - 1; i >= 0; i--) {
    console.log(arr3[i]);
}

// 9. всі попередні завдання (окрім 8), але в зворотному циклі (с заду на перед)
//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// створити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти найбільшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор